[{"content":"\nSo I just finished redesigning my blog, for the 4th and hopefully the last time in a while, it looks amazing and minimal and has all the bells and whistles I've wanted, but I've just now realized that I am missing the most important thing: **the content**. I still haven't figured out what I want to write about, now being the person who I am, I have a ton of hobbies:\n\n- Programming, specifically Web Development. that's why I chose to become a Computer Science Major, even though most people I've spoken to told me not to\n- Tech in general, let that be hardware or software\n- I love learning about how to make the most out of my time\n- I am also interested in history, I enjoy learning about how people used to live back in the ol' days and how things we now see as a given were created or discovered\n- And much more\n\n---\n\nWhen I originally had the idea to start a blog, I thought I am going to make a dev blog (i.e. write content and tutorials for developers) because that's what everyone I followed on the internet did, but now that I am able to start writing I've started to question what my content should be about, and I faced a bit of a dilemma\n\n1. On one hand, Anyone who knows about content creation knows that focusing on one topic, is extremely rewarding in terms of engagement (especially when that topic is programming), because there will be a big audience interested in that type of content\n2. On the other hand, what I enjoy the most is writing about a whole bunch of different things, but that means that I will get basically zero interest in my posts because no one will be interested in _all_ of the topics that I will write about, which means I won't be able to turn this into a career and start earning money from it\n\nSo now I have to decide whether I want to write as a hobby about whatever I want and not receive any engagement or I could pick a topic and focus on that and potentially turn this whole thing into a career\n\n---\n\nI would have loved to end this post with <q>The plan right now is...</q> but in all honesty, I don't have a plan and haven't yet figured out what my goal here is. If you've got something to say or if this post sparked some thoughts for you, feel free to [tweet me](https://twitter.com/intent/tweet?text=%40spacebuffer) (or [toot me](https://fosstodon.org/web/@spacebuffer), if that's what you're into), I'll read every single one!\n","data":{"title":"The Content Creation Dilemma","date":"2022-10-09","slogan":"Figuring out your goal is pretty hard"},"filePath":"the-content-creation-dilemma.mdx"},{"content":"\nPerfectionism is often seen as a good thing, and people should try and reach it whenever they can, but that may not always be true, being a perfectionist can stop you from finishing what you started or even not start at all..\n\n## Quantity over Quality\n\nYou should aspire to make and publish so much, because only a subset of the things you publish is going to be popular and you don’t know which “thing” will be a hit because it depends on many factors that you aren’t in control of. Let’s look at some examples:\n\n- A photography professer ran a month-long experiment in which he devided his students in 2 groups, the first had to take 1 photo through out the whole month on which they will be graded, the second had to take as they can and they were graded on the number of ones they took, surprisingly the group that had more time to polish up that single photo, on average, **did worse** than the one that took more photos in a short time span\n- Irving Berlin wrote 1500 songs, out of which, only 25 hit #1, this perfectly illustrates that no one can know what things will become popular, if irving had only published the songs that _he_ tought were good, then he probably would have never gotten a single hit.\n- Ali Abdaal said in many of his [videos](https://twitter.com/aliabdaal/status/1362144792197611523) and in his [Part-time youtuber academy](https://academy.aliabdaal.com/) that the first 100 videos of any youtuber are going to be crap, so youtubers who are just starting out should focus on getting those first videos out of the way and not care much about their quality\n\nBy applying the quantity over quality motto in everything you do, you’ll eventually reach the quality you wanted to begin with, this is known as **Quality _Through_ Quantity**\n\n## Finishing vs Publishing\n\nWhen you create a thing (book, song, blog post) it's never done until you decide to publish it. you may find yourself stuck in a state where you never actually publish anything because you’re always seeking perfection. A thing is finished once you decide it’s finished, _aka_ by publishing it.\nAs an example I am about to publish this post even thought, I know it’s far from perfect, but I already spent a lot of time writting it and have shared everything I wanted to tell the world initially, if I keep going I know I’ll spend 10x the amount of time and finally publish a post that’s only 5% better instead I opted-in to publish it as it is right now and focus on making other cool ideas a reality\n\n## How do people publish so much\n\nSucessful people publish so much because they are actually working to publish not working for pleasure. Working for pleasure is very important but it only should take a limited amount of your time.\n\n<table>\n  <thead>\n    <tr>\n      <th>Working to publish</th>\n      <th>Working for pleasure</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <td>Selfless</td>\n      <td>Inward Focused</td>\n    </tr>\n    <tr>\n      <td>Outward Focused</td>\n      <td>Giving to oneself</td>\n    </tr>\n    <tr>\n      <td>Contributing to the world</td>\n      <td>Extremly fun</td>\n    </tr>\n  </tbody>\n</table>\n\n## Raw can be better\n\nIn certain cases, polishing up can make things look worse, that’s because humans, by nature, love when something is raw = can have mistakes = is relatable.\n\n- Pomplomoose, a band that’s very close to my heart has used a take where the singer forgot the lyrics and started laughing, most people loved this and thought it made the song so much better\n- The National Arab Orchestra ran a program called [Building Bridges Through Music](https://www.youtube.com/playlist?list=PLWygykGd2MWhVO-JFk1hgclyMoCv34ktr) where they would go to schools in the USA and teach them arabic music to get a chance to sing in an orchestra, even though their arabic accent was far from perfect, it made the experience much better by allowing me, an arabic speaker who grew up listening to these songs, rediscover them in a new way.\n\n---\n\nSo that's pretty much it, I hope you enjoyed my first write-up, I'll catch you in the next one!\n","data":{"title":"Don't seek perfection","date":"2022-10-06","slogan":"The ultimate work interview answer BUSTED!"},"filePath":"perfectionism.mdx"},{"content":"\nHello friend, welcome to my first post! I am so excited because this is my first time coding something that's actually 100% mine, I usually use themes or pre-made website and change little things, but this time I decided I had enough and needed to actually learn how to code and it was a fantastic experience!\n\nI'll later make a full write-up on how exactly I made this blog but for now here are the main things I used:\n\n- **Next.js** (react) as my framework of choice\n- **Vercel** for deploying, it integrates very well with Next.js\n- **MDX**, or more specifically [mdx-bundler](https://github.com/kentcdodds/mdx-bundler) to allow me have react components inside of my markdown files but I am still getting the hang of that one\n- and more recently **Tailwind CSS** as I redesigned my blog using it and it's fantastic\n\nThe full source code is available on <a href=\"https://github.com/spcbfr/nextjs-blog\" target=\"_blank\">github</a>, feel free to look through my terible spaghetti code, but remember to Star the project\n\n## Goals\n\nI first created my twitter account because I needed a place to share my feelings with the world, and it surved it's purpose, but quickly I realized that I wanted my own **digital garden** you could say, where I can write and express my opinions freely and that's how this blog was born.\n\nMy goal is to try and write _the best posts possible_, and to teach the reader something new every time and to also stay consistent and post at least biweekly\n\n## Content\n\nThis blog is not just a dev blog, I'll occasionally also post about other stuff like:\n\n- Movies and TV shows\n- Book reviews\n- Hardware\n- Linux\n- Tech in general\n\nThat's pretty much it, as always, thanks for reading!\n","data":{"title":"My first blog post","date":"2022-09-20","slogan":"Embarking on a new journey"},"filePath":"first-post.mdx"}]